---
kind: property
id: P:Autodesk.Revit.DB.SymbolTypeId.NDashM
source: html/a6e8ad63-572a-ac5b-11aa-fd7e36dee0c7.htm
---
# Autodesk.Revit.DB.SymbolTypeId.NDashM Property

Symbol N-m, indicating unit Newton meters.

## Syntax (C#)
```csharp
public static ForgeTypeId NDashM { get; }
```